In [16]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [17]:
#Q1
q1=pd.Series(['saleh','ali','nasser'])
q1.index=[1,2,3]
print(q1)

1     saleh
2       ali
3    nasser
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [18]:
#Q2
q1.index=[11,12,13]
print(q1)

11     saleh
12       ali
13    nasser
dtype: object

## Q3: Retrieve First and second elements.

In [19]:
#Q3
print(q1[:1])

11    saleh
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [20]:
#Q4
x=pd.Series(q1)
l=pd.concat([q1,x])
print('q4:\n',l)
l=l.drop_duplicates()
print(f'after dropping duplicate \n{l}')

q4:
 11     saleh
12       ali
13    nasser
11     saleh
12       ali
13    nasser
dtype: object
after dropping duplicate
11     saleh
12       ali
13    nasser
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [22]:
#Q5
Students=pd.DataFrame(columns=['ID','Name','GPA'])
Students

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [15]:
#Q6
edu=pd.read_csv('educ_figdp_1_Data.csv')
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [13]:
#loc 
edu.loc[250:254, ['GEO', 'Value']]

            GEO Value
250   Lithuania  5.36
251   Lithuania  5.17
252  Luxembourg     :
253  Luxembourg  3.75
254  Luxembourg  3.79

In [12]:
edu[200:207]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
200,2008,France,Total public expenditure on education as % of ...,5.62,NaN
201,2009,France,Total public expenditure on education as % of ...,5.90,NaN
202,2010,France,Total public expenditure on education as % of ...,5.86,NaN
203,2011,France,Total public expenditure on education as % of ...,5.68,NaN
204,2000,Italy,Total public expenditure on education as % of ...,4.52,NaN
205,2001,Italy,Total public expenditure on education as % of ...,4.83,NaN
206,2002,Italy,Total public expenditure on education as % of ...,4.60,NaN